<template>
	<view>
		<view class="title">APP隐私政策</view>
		<view class="con">			
			<text>本应用尊重并保护所有使用服务用户的个人隐私权。为了给您提供更准确、更有个性化的服务，本应用会按照本隐私权政策的规定使用和披露您的个人信息。但本应用将以高度的勤勉、审慎义务对待这些信息。除本隐私权政策另有规定外，在未征得您事先许可的情况下，本应用不会将这些信息对外披露或向第三方提供。本应用会不时更新本隐私权政策。 您在同意本应用服务使用协议之时，即视为您已经同意本隐私权政策全部内容。本隐私权政策属于本应用服务使用协议不可分割的一部分。	    </text>

			<text>1. 适用范围
			</text>
		
			<text> (a) 在您注册本应用帐号时，您根据本应用要求提供的个人注册信息；
			</text>
		
			<text>(b) 在您使用本应用网络服务，或访问本应用平台网页时，本应用自动接收并记录的您的浏览器和计算机上的信息，包括但不限于您的Itext地址、浏览器的类型、使用的语言、访问日期和时间、软硬件特征信息及您需求的网页记录等数据；
			</text>
		
			<text>(c) 本应用通过合法途径从商业伙伴处取得的用户个人数据。
			</text>
		
			<text>您了解并同意，以下信息不适用本隐私权政策：
			</text>
		
			<text>(a) 您在使用本应用平台提供的搜索服务时输入的关键字信息；
			</text>
		
			<text>(b) 本应用收集到的您在本应用发布的有关信息数据。
			</text>
		
			<text>(c) 违反法律规定或违反本应用规则行为及本应用已对您采取的措施。
			</text>
		
			<text>2. 信息使用
			</text>
		
			<text>(a)本应用不会向任何无关第三方提供、出售、出租、分享或交易您的个人信息，除非事先得到您的许可，或该第三方和本应用（含本应用关联公司）单独或共同为您提供服务，且在该服务结束后，其将被禁止访问包括其以前能够访问的所有这些资料。
			</text>
		
			<text>(b) 本应用亦不允许任何第三方以任何手段收集、编辑、出售或者无偿传播您的个人信息。任何本应用平台用户如从事上述活动，一经发现，本应用有权立即终止与该用户的服务协议。
			</text>
		
			<text>(c) 为服务用户的目的，本应用可能通过使用您的个人信息，向您提供您感兴趣的信息，包括但不限于向您发出产品和服务信息，或者与本应用合作伙伴共享信息以便他们向您发送有关其产品和服务的信息（后者需要您的事先同意）。
			</text>
		
			<text>3. 信息披露
			</text>
		
			<text>(a) 经您事先同意，向第三方披露；
			</text>
		
			<text>(b)为提供您所要求的产品和服务，而必须和第三方分享您的个人信息；
			</text>
		
			<text>(c) 根据法律的有关规定，或者行政或司法机构的要求，向第三方或者行政、司法机构披露；
			</text>
		
			<text>(d) 如您出现违反中国有关法律、法规或者本应用服务协议或相关规则的情况，需要向第三方披露；
			</text>
		
			<text>(e)如果您是在收集过程中出现信息泄露，我们有权查询信息泄露路径，进行自我申辩。
			</text>
		
			<text>f) 在本应用平台上创建信息对接中，如发送信息一方或接受信息一方提出信息披露请求的，本应用有权决定向该用户提供对方的联络方式等必要信息，以促成信息有效对接。
			</text>
		
			<text>(g) 其它本应用根据法律、法规或者网站政策认为合适的披露。
			</text>
		
			<text>4. 信息存储和交换
			</text>
		
			<text>本应用收集的有关您的信息和资料将保存在本应用及（或）其关联公司的服务器上，这些信息和资料可能传送至您所在国家、地区或本应用收集信息和资料所在地的境外并在境外被访问、存储和展示。
			</text>
		
			<text>5. 信息安全</text>
		
			<text>(a) 本应用帐号均有安全保护功能，请妥善保管您的用户名及密码信息。本应用将通过对用户密码进行加密等安全措施确保您的信息不丢失，不被滥用和变造。尽管有前述安全措施，但同时也请您注意在信息网络上不存在“完善的安全措施”。
			</text>
		
			<text>    6.本隐私政策的更改	    </text>
		
			<text>（a）如果决定更改隐私政策，我们会在本政策中、本公司网站中以及我们认为适当的位置发布这些更改，以便您了解我们如何收集、使用您的个人信息，哪些人可以访问这些信息，以及在什么情况下我们会透露这些信息。
			</text>
		
			<text>（b）本公司保留随时修改本政策的权利，因此请经常查看。如对本政策作出重大更改，本公司会通过网站通知的形式告知。
			</text>
		
			<text>7.知识产权相关	    </text>
		
			<text>（a）您了解并同意我方有权随时检查您所上传或发布的内容，如果发现您上传的内容不符合前述规定，我方有权删除或重新编辑或修改您所上传或发布的内容，且有权在不事先通知您的情况下停用您的账号。您亦了解、同意并保证，您所上传或发布的内容符合前述规定，是您的义务，而非我方，我方无任何对您上传或发布的内容进行主动检查、编辑或修改的义务。
			</text>
		
			<text>（b）若您在本软件上的上传或发布内容的行为给第三方带来损害或损失，第三方主张赔偿或衍生的任何其他权利的，由您独立承担全部法律责任，我方及合作方概不承担任何责任。
			</text>
		
			<text>（c）我方不对用户上传或发布的内容的合法性、正当性、完整性或品质作出任何保证，用户需自行承担因使用或依赖由软件所传送的内容或资源所产生的风险，我方在任何情况下对此种风险可能或实际带来的损失或损害都不负任何责任。
			</text>
		
			<text>8.法律责任与免责申明	    </text>
		
			<text>（a）我方将会尽其商业上的合理努力以保护用户的设备资源及通讯的隐私性和完整性，但是，用户承认和同意我方不能就此事提供任何保证。
			</text>
		
			<text>（b）我方可以根据用户的使用状态和行为，为了改进软件的功能、用户体验和服务，开发或调整软件功能
			</text>
		
			<text>（c）因技术故障等不可抗事件影响到服务的正常运行的，我方及合作方承诺在第一时间内与相关单位配合，及时处理进行修复。
			</text>
	    </view>
	</view>
</template>

<script>
	export default {
		data() {
			return {
				
			}
		},
		methods: {
			
		}
	}
</script>

<style>
	page{
		padding: 0 30rpx;
		margin-bottom: 60rpx;
		box-sizing: border-box;
		background-color: #f5f5f5;
	}
	.title{
		font-weight: bold;
		text-align: center;
		line-height: 80rpx;
	}
	text{
		display: inline-block;
		text-indent: 2em;
		text-align: justify;
	}
</style>
