<template>
	<view class="place_info">
		<view class="title">{{data1[0].sTitle}}</view>
		<view class="img">
			<image :src="data1[0].photoUrl" mode="aspectFit"></image>
		</view>
		<!-- <view>{{data1[0].sContent}}</view> -->
		<view v-for="(item,index) in data1[0].sContent" :key="index">
			<view class="duan" v-if="item.value1!=''"><text class="text"></text>{{item.value1}}</view>
			<view class="duan" v-if="item.value2!=''"><text class="text"></text>{{item.value2}}</view>
			<view class="duan" v-if="item.value3!=''"><text class="text"></text>{{item.value3}}</view>
		</view>
	</view>
</template>

<script>
	export default {
		data() {
			return {
				id:'',
				obj:{},
				data1:[],
				data: [
					{
						"ID": 66,
						"Name": "丰南区清真寺",
						"sTitle": "丰南区清真寺",
						"photoUrl": "../../../static/PlaceInfo/66.jpg",
						"sContent": [
							{
								value1:"丰南清真寺（原名胥各庄清真寺）座落在丰南区唐胥路200号。丰南清真原名胥各庄清真寺，始建于清光绪19年（公元1893年），原址位于丰南区胥各庄二街，1976年毁于“七•二八”唐山大地震。2002年，为了配合政府城区改造，清真寺迁至现址，作为临时宗教活动场所。",
								value2:"2017年，区委、区政府办公会议决定新建丰南清真寺。工程于5月20日破土动工，2018年1月1日，清真寺主体工程竣工并投入使用，总建筑面积765.37㎡，为全区穆斯林提供宗教服务。",
								value3:"清真寺管理委员会由9人组成，设主任1名，副主任1名，现有驻寺阿訇1人。几年来，清真寺认真贯彻“双创四进”活动精神，积极引导穆斯林爱国爱教，关注公益事业，杜绝“达瓦宣教”等极端思想渗透，多次组织穆斯林在“5.21”地震、青海玉树地震等重大灾害时期为灾区和慈善机构捐款，在新冠疫情防控期间，清真寺向卫生防疫部门捐资3万8千余元，为构建和谐社会做出积极的贡献。"
							}
						],
					},
					{
						"ID": 67,
						"Name": "丰南区丰南镇八街基督教活动点",
						"sTitle": "丰南区丰南镇八街基督教活动点",
						"photoUrl": "../../../static/PlaceInfo/67.jpg",
						"sContent":[
							{
								value1:"胥各庄镇八街基督教临时活动点自2010年2月1日经丰南区民政局批准正式建立，原址位于丰南区胥各庄八街13排18号。2010年3月，活动点面临拆迁改造，信徒群众陷入无合适的活动场所的窘境。后经区民族宗教部门与胥各庄镇政府等多方协调，活动点于 2014年10月18日办理了活动场所地址变更手续，迁至丰南镇建设路自强楼3排1号，组织全镇基督教信徒开展活动。",
								value2:"临时活动点现有房屋9间，为上下两层，建筑面积约150平米，内设网络、摄像、闭路电视、音响等设备。每周六下午，由唐山市基督教堂差派牧师或传道员为信徒传道，固定于此处参加活动的信徒近二百人。",
								value3:"几年来，临时活动点积极引导信徒关注公益事业，为构建和谐社会做出积极的贡献。先后与丰南区截瘫病疗养院、敬老院结为联谊单位，为病人和孤寡老人送去抚慰和关怀。积极投身关爱自闭症儿童，为星愿特殊学校的孩子带来温暖。在“5.21”地震、青海玉树地震等重大灾害时期为灾区和慈善机构捐资三万七千八百余元。在2020年初新冠疫情防控期间，临时活动点向丰南区红十字会捐款两万五千元。",
							}
						],
					},
					{
						"ID": 68,
						"Name": "丰南区小稻地天主教堂",
						"sTitle": "丰南区小稻地天主教堂",
						"photoUrl": "../../../static/PlaceInfo/68.jpg",
						"sContent": [
							{
								value1:"小稻地村天主教历史悠久，小稻地村天主教堂始建于1907年(光绪三十三年)，1990年重建，1994年6月竣工，建成新式歌德式建筑。教堂占地7.37亩，相关设施齐备。目前，天主教堂有神父一名，教友480余名。教堂积极组织开展创建和谐寺观教堂和创建先进宗教团体活动，不断加强宗教活动场所管理，将宪法、国旗、社会主义核心价值观和中华优秀传统文化全部进入宗教活动场所。",
								value2:"",
								value3:"",
							}
						],
					},
					{
						"ID": 69,
						"Name": "丰南区药王寺",
						"sTitle": "丰南区药王寺",
						"photoUrl": "../../../static/PlaceInfo/69.jpg",
						"sContent": [
							{
								value1:"原址位于唐山市丰南区东田庄乡付庄子村，始建于明嘉靖二十七年。明崇祯年间，成都人李来秀考取探花，先任职于翰林院，后执掌密云县知事。清军入关后，他看破红尘，流落至药王庙，削发为僧，人称函宏法师或老仙师。康熙三十九年圆寂，其真身百年不腐，药王庙因此名声大振，每年农历四月二十八庙会，敬香还愿者遍布7省18县，后毁于建国初期。应广大信众要求，2013年，经河北省民族宗教事务厅批准，辽宁省万佛禅寺住持上果下证法师发愿重建大药王寺。2013年6月16日，在唐津运河西岸、王打刁村南举行奠基仪式，2017年末建成使用。",
								value2:"新建大药王寺殿宇恢宏，绿树掩映；玉塔高耸，宝相庄严；东依静湖，风景旖旎；西接碧野，万顷苍翠。可谓静修佳处。药王寺的复建，体现党的宗教信仰自由政策得到全面落实，也促进当地宗教文化事业健康发展。",
								value3:"",
							}
						],
					},
					{
						"ID": 70,
						"Name": "丰南区王兰庄基督教活动点",
						"sTitle": "丰南区王兰庄基督教活动点",
						"photoUrl": "../../../static/PlaceInfo/70.jpg",
						"sContent": [
							{
								value1:"丰南区王兰庄基督教临时活动点位于王兰庄镇王兰庄一村，始建于2015年。现有礼拜堂1间，副堂1间，可容纳200余人，管理组织和管理制度健全，安全设施完备，该堂点活动时间一般为周日，每次参与活动人数在50人左右，信徒除本村部分群众外，其余来自周边村庄，在年龄方面，多为中老年信徒。该堂点有合法持证的传道者5人。",
								value2:"在新冠肺炎疫情期间，该堂点积极响应政府号召，带领信徒伸出援助之手，踊跃为支持新冠肺炎疫情阻击战进行捐款，为打赢这场战“疫”贡献自己的力量。",
								value3:"",
							}
						],
					},
					{
						"ID": 71,
						"Name": "丰南区五相庄基督教活动点",
						"sTitle": "丰南区五相庄基督教活动点",
						"photoUrl": "../../../static/PlaceInfo/71.jpg",
						"sContent":  [
							{
								value1:"丰南区五相庄基督教临时活动点自2005年3月6日经丰南区民政局批准正式建立，原址在丰南区五相庄村，信徒芦建茹家中，后因信徒人数增加容纳不开，经管理小组决定买房。于2010年10月购置五相庄村民张再成平房三间，324平方米，经装修于2011年7月13日正式聚会。",
								value2:"活动点每周日上午8：00--10：00活动，由唐山市基督教堂派传道员来为信徒传道，固定于本活动点活动的信徒约有200人左右，每当圣诞节、复活节等重大节日，会吸引周边更多的信徒前来聚会。",
								value3:"",
							}
						],
					},
					{
						"ID": 72,
						"Name": "丰南区大新庄玉洪寺",
						"sTitle": "丰南区大新庄玉洪寺",
						"photoUrl": "../../../static/PlaceInfo/72.jpg",
						"sContent": [
							{
								value1:"玉洪寺坐落在唐山市丰南区大新庄一村北侧。始建于清光绪十六年（公元1890年），后毁于唐山大地震。2002年元月开始复建，2007年竣工，寺院占地7000平方米，坐北朝南三层大殿。玉洪寺“以爱国爱教，遵纪守法；严持戒律，普度众生”为宗旨。坚持佛教中国化道路，规范、严谨、虔诚地举办各种佛教活动，定期学习党的各项方针政策，协助政府有关部门开展社会公益活动，为社会主义精神文明建设做出了应有的贡献。",
								value2:"",
								value3:"",
							}
						],
					},
					{
						"ID": 73,
						"Name": "丰南区大新庄基督教活动点",
						"sTitle": "丰南区大新庄基督教活动点",
						"photoUrl": "../../../static/PlaceInfo/73.jpg",
						"sContent": [
							{
								value1:"大新庄新一村基督教临时活动点于2005年9月10日经丰南区民政局批准，正式建立聚会场所。2007年初经民主管理小组讨论同意，购买了大新庄一村一块面积1885平方米的土地，并开始建造教堂。同年5月18日南大堂投入使用，2009年又买下南边七间平房的小院，2001年经扩建成为目前的教堂，现有信徒200余人，所有信徒主要的活动是唱诗、敬拜、聚会等内容。在开展任何宗教活动时，都能严格遵守国家各项法律法规，本着“爱国爱教”原则，贯彻执行上级统战、民宗部门的各项政策和要求，做到不打折扣的落实。",
								value2:"",
								value3:"",
							}
						],
					},
					{
						"ID": 74,
						"Name": "南孙庄天主教堂",
						"sTitle": "南孙庄天主教堂",
						"photoUrl": "../../../static/PlaceInfo/74.jpg",
						"sContent": [
							{
								value1:"南孙庄天主教堂于1929年兴建，该教堂位于南孙庄村西路南，面积约120平方米，1976年因地震房屋震毁。1999年经唐山市民族宗教局批准建堂，建筑面积806平方米。目前，在堂内参加活动的信教群众约120人左右。",
								value2:"教堂积极组织开展创建和谐寺观教堂和创建先进宗教团体活动，不断加强宗教活动场所管理，将宪法、国旗、社会主义核心价值观和中华优秀传统文化全部进入宗教活动场所，爱国爱教已成为信教群众共识。",
								value3:"",
							}
						],
					},
					{
						"ID": 75,
						"Name": "钱营基督教点",
						"sTitle": "钱营基督教点",
						"photoUrl": "../../../static/PlaceInfo/75.jpg",
						"sContent": [
							{
								value1:"钱营镇北阳庄基督教以堂带点位于北阳庄村小康路八区7排59号,面积64平方米，属于纳入唐山市五家庄基督教堂管理的家庭聚会点,是由丰南区民政局批准的合法聚会场所，参加聚会的信众43人。",
								value2:"北阳庄基督教以堂带点积极引导广大信教群众树立正确的基督教信仰,维护社会稳定,建立和谐美满幸福的家庭,培养积极向上的精神取向。爱人如己,爱国爱教,弘扬社会主义核心价值观。",
								value3:"",
							}
						],
					},
				]
			}
		},
		onLoad:function(option){
			console.log(option)
			console.log(this.data[2].ID)
			this.id=option.ID
			for(var i=0;i<this.data.length;i++){
				if(this.data[i].ID==this.id){
					this.data1.push(this.data[i])
				}
			}
		},
	}
</script>

<style scoped lang="scss">
	.place_info {
		width: 100%;
		height: 100%;
		padding: 15rpx 30rpx;
		box-sizing: border-box;
		.title{
			text-align: center;
			font-size: 28px;
		}
		.duan{
			margin-bottom: 20rpx;
		}
		.img{
			width: 100%;
			height: 500rpx;
			margin: 20rpx 0;
		}
		.img image {
			width: 100%;
			height: 100%;
		}
		.text{
			width: 60rpx;
			height: 100%;
			display: inline-block;
		}

	}
</style>
